In [2]:
import pandas as pd
sample_data = {
    'name': ['Sreekanth', 'Harsha', 'Chinna'],
    'skill': ['Study', 'Crazy', 'Silent'],
    'nxt': ['Hacker', 'Killer', 'Unq']
}
df = pd.DataFrame(sample_data)
df

        name   skill     nxt
0  Sreekanth   Study  Hacker
1     Harsha   Crazy  Killer
2     Chinna  Silent     Unq

In [6]:
row, col = df.shape
df.name

0    Sreekanth
1       Harsha
2       Chinna
Name: name, dtype: object

In [7]:
type(df.nxt)

pandas.core.series.Series

In [8]:
df[['name', 'nxt']]

        name     nxt
0  Sreekanth  Hacker
1     Harsha  Killer
2     Chinna     Unq

In [12]:
sample_data_2 = {
    'name': ['Sreekanth', 'Harsha', 'Chinna'],
    'skill': ['Study', 'Crazy', 'Silent'],
    'nxt': ['Hacker', 'Killer', 'Unq'],
    'age': [25, 26, 29],
    'sal': [8000, 15000, 50000]
}
df_2 = pd.DataFrame(sample_data_2)
df_2.describe()

             age           sal
count   3.000000      3.000000
mean   26.666667  24333.333333
std     2.081666  22501.851776
min    25.000000   8000.000000
25%    25.500000  11500.000000
50%    26.000000  15000.000000
75%    27.500000  32500.000000
max    29.000000  50000.000000

In [14]:
df_2.set_index('age')

          name   skill     nxt    sal
age
25   Sreekanth   Study  Hacker   8000
26      Harsha   Crazy  Killer  15000
29      Chinna  Silent     Unq  50000

In [17]:
df_2

          name   skill     nxt    sal
age
25   Sreekanth   Study  Hacker   8000
26      Harsha   Crazy  Killer  15000
29      Chinna  Silent     Unq  50000

In [19]:
df_2.loc[26]

name     Harsha
skill     Crazy
nxt      Killer
sal       15000
Name: 26, dtype: object

In [23]:
df_2.reset_index(inplace=True)

In [24]:
df_2

   age       name   skill     nxt    sal
0   25  Sreekanth   Study  Hacker   8000
1   26     Harsha   Crazy  Killer  15000
2   29     Chinna  Silent     Unq  50000

In [25]:
data = [
    ('Sreekanth', 'Hacker', 8000),
    ('Harsha', 'Killer', 15000)
]

df_3 = pd.DataFrame(data, columns=['Name', 'nxt', 'sal'])
df_3

        Name     nxt    sal
0  Sreekanth  Hacker   8000
1     Harsha  Killer  15000